# GetUnitsName Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisResultSchema..::..GetUnitsName Method
AnalysisResultSchema Class See Also
---
returns units name by index
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public string GetUnitsName(
	int index
)
```

Visual Basic
---
```text
Public Function GetUnitsName ( _
	index As Integer _
) As String
```

Visual C++
---
```text
public:
String^ GetUnitsName(
	int index
)
```

# ### Parameters
index
    Type: System..::..Int32 index of unit in the list
# See Also
AnalysisResultSchema Class
Autodesk.Revit.DB.Analysis Namespace